In [24]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline 
from sqlalchemy import create_engine

In [39]:
df1= pd.read_csv('inactieve_putten - page 1 2.csv',skiprows=1,sep=',')

In [40]:
df1

   132 Oude Hengelosedijk Enschede  52.232991  6.781566
0  259       Baardinkseweg Hengelo  52.239356  6.813606
1  343          Molenveld Enschede  52.215560  6.798513
2  357          Wullenweg Enschede  52.229623  6.779387

In [25]:
engine = create_engine('postgresql://postgres:Welkom01!@10.30.1.10:5432/POC')

In [34]:
df= pd.read_sql("""
select * from meting m
join locatie l on
m.pnt_id = l.pnt_id;


""",engine)

In [35]:
df

Empty DataFrame
Columns: [id, pnt_id, datum, meting, sat_id, id, pnt_id, locatie, pnt_lat, pnt_lon]
Index: []

In [36]:
def GradenNaarMeters(meters):
   graden=(meters/30.92)/3600
   return graden

In [ ]:
def puntenverzamelaar(df):